import React from 'react';
import { FullReport } from './_components/full-report';
import { Chart } from './_components/chart';

const reportData = [
  {
    id: '1',
    title: 'تقرير تحليل صحي شامل',
    content: `الكالسيوم الكلي في الدم هو اختبار دم يتم إجراؤه لقياس الأشكال الحرة والمقيدة للكالسيوم. غالبا ما يكون جزءا من اختبار الفحص للكشف عن مستويات الكالسيوم المرتفعة والمنخفضة بشكل غير طبيعي ، حيث يمكن أن يؤثر كلاهما على الصحة. التأثير على الصحة العامة؟ يمكن أن تحدث مستويات غير طبيعية من الكالسيوم بسبب مشاكل في امتصاص الكالسيوم وأمراض العظام ، فرط نشاط الغدة الدرقية ، مرض الغدة الدرقية ، أمراض الكلى أو الكبد. كيفية تحسين الظروف الصحية؟ بالنسبة لمستويات الكالسيوم المنخفضة ، فإن اتباع نظام غذائي يحتوي على الأطعمة الغنية بالكالسيوم هو التوصية`,
  },
  {
    id: '2',
    title: 'تقرير تحليل صحي شامل',
    content: `الكالسيوم الكلي في الدم هو اختبار دم يتم إجراؤه لقياس الأشكال الحرة والمقيدة للكالسيوم. غالبا ما يكون جزءا من اختبار الفحص للكشف عن مستويات الكالسيوم المرتفعة والمنخفضة بشكل غير طبيعي ، حيث يمكن أن يؤثر كلاهما على الصحة. التأثير على الصحة العامة؟ يمكن أن تحدث مستويات غير طبيعية من الكالسيوم بسبب مشاكل في امتصاص الكالسيوم وأمراض العظام ، فرط نشاط الغدة الدرقية ، مرض الغدة الدرقية ، أمراض الكلى أو الكبد. كيفية تحسين الظروف الصحية؟ بالنسبة لمستويات الكالسيوم المنخفضة ، فإن اتباع نظام غذائي يحتوي على الأطعمة الغنية بالكالسيوم هو التوصية`,
  },
];

const Page = ({ params }) => {
  const { reportId } = params;

  return (
    <>
      <FullReport {...reportData.find((item) => item.id === reportId)} />
      <Chart />
    </>
  );
};

export default Page;
