export const FAQDATA = [
  {
    id: 1,
    label: 'طرق الدفع',
    content:
      'سبيكترا هو أول مركز طب إتصالي و رعاية عن بعد، يقوم بتشخيص و علاج و رعاية إضطرابات تطور و سلوك الاطفال، عن طريق فرقنا المتعددة التخصصات المختارة بعناية، وفق جودة و معايير فنية و مهنية عالمية .',
  },
  {
    id: 2,
    label: 'كيف استطيع عمل جلسة الكشف المبكر؟',
    content: '',
  },
  {
    id: 3,
    label:
      'ماهو فريق التشخيص متعدد التخصصات، Multidisciplinary team (MDT) ؟',
    content: '',
  },
  {
    id: 4,
    label:
      'هل علي الحضور في مكان معين للحصول على الخدمة؟ و ماهي التجهيزات المطلوبة مني ؟',
    content: '',
  },
  {
    id: 5,
    label: 'ما مدى السرية التي سأحظى بها؟',
    content: '',
  },
];
