export const STORIES = [
  {
    id: 'story-1',
    childName: 'حلا محمد العانزي',
    daignosis: 'اضطراب طيف التوحد',
    image: '/demo-baby-1.png',
    story: {
      description:
        'اضطراب طيف التوحد عبارة عن حالة ترتبط بنمو الدماغ وتؤثر على كيفية تمييز الشخص للآخرين والتعامل معهم على المستوى الاجتماعي، مما يتسبب في حدوث مشكلات في التفاعل والتواصل الاجتماعي.',
      beforeTreatment: [
        'يرفض العناق والإمساك به، ويبدو أنه يفضل اللعب بمفرده؛ أي ينسحب إلى عالمه الخاص',
        'عدم الكلام أو التأخر في الكلام، أو قد يفقد الطفل قدرته السابقة على التلفظ بالكلمات والجمل',
        'يتكلم بنبرة أو إيقاع غير طبيعي؛ وقد يستخدم صوتًا رتيبًا أو يتكلم مثل الإنسان الآلي',
      ],
      cureMethod: [
        {
          id: '01',
          text: 'العلاجات التربوية. غالبًا ما يستجيب الأطفال المصابون باضطراب طيف التوحد جيدًا للبرامج التربوية التي تتميز بدرجة عالية من التنظيم.',
          image: '/demo-baby-6.png',
        },
        {
          id: '02',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-7.png',
        },
        {
          id: '03',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-8.png',
        },
      ],
      afterTreatment: [
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوملوري',
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم',
      ],
      familyReview:
        'شكرا سبيكترا وكل الرفيق الطبى لطريقة العلاج المرنة جدا وشوط طريق طويل والنتيجة جدا رائعة',
      video: '',
    },
  },
  {
    id: 'story-2',
    childName: 'حلا محمد العانزي',
    daignosis: 'اضطراب طيف التوحد',
    image: '/demo-baby-2.png',
    story: {
      description:
        'اضطراب طيف التوحد عبارة عن حالة ترتبط بنمو الدماغ وتؤثر على كيفية تمييز الشخص للآخرين والتعامل معهم على المستوى الاجتماعي، مما يتسبب في حدوث مشكلات في التفاعل والتواصل الاجتماعي.',
      beforeTreatment: [
        'يرفض العناق والإمساك به، ويبدو أنه يفضل اللعب بمفرده؛ أي ينسحب إلى عالمه الخاص',
        'عدم الكلام أو التأخر في الكلام، أو قد يفقد الطفل قدرته السابقة على التلفظ بالكلمات والجمل',
        'يتكلم بنبرة أو إيقاع غير طبيعي؛ وقد يستخدم صوتًا رتيبًا أو يتكلم مثل الإنسان الآلي',
      ],
      cureMethod: [
        {
          id: '01',
          text: 'العلاجات التربوية. غالبًا ما يستجيب الأطفال المصابون باضطراب طيف التوحد جيدًا للبرامج التربوية التي تتميز بدرجة عالية من التنظيم.',
          image: '/demo-baby-6.png',
        },
        {
          id: '02',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-7.png',
        },
        {
          id: '03',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-8.png',
        },
      ],
      afterTreatment: [
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوملوري',
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم',
      ],
      familyReview:
        'شكرا سبيكترا وكل الرفيق الطبى لطريقة العلاج المرنة جدا وشوط طريق طويل والنتيجة جدا رائعة',
      video: '',
    },
  },
  {
    id: 'story-3',
    childName: 'حلا محمد العانزي',
    daignosis: 'اضطراب طيف التوحد',
    image: '/demo-baby-3.png',
    story: {
      description:
        'اضطراب طيف التوحد عبارة عن حالة ترتبط بنمو الدماغ وتؤثر على كيفية تمييز الشخص للآخرين والتعامل معهم على المستوى الاجتماعي، مما يتسبب في حدوث مشكلات في التفاعل والتواصل الاجتماعي.',
      beforeTreatment: [
        'يرفض العناق والإمساك به، ويبدو أنه يفضل اللعب بمفرده؛ أي ينسحب إلى عالمه الخاص',
        'عدم الكلام أو التأخر في الكلام، أو قد يفقد الطفل قدرته السابقة على التلفظ بالكلمات والجمل',
        'يتكلم بنبرة أو إيقاع غير طبيعي؛ وقد يستخدم صوتًا رتيبًا أو يتكلم مثل الإنسان الآلي',
      ],
      cureMethod: [
        {
          id: '01',
          text: 'العلاجات التربوية. غالبًا ما يستجيب الأطفال المصابون باضطراب طيف التوحد جيدًا للبرامج التربوية التي تتميز بدرجة عالية من التنظيم.',
          image: '/demo-baby-6.png',
        },
        {
          id: '02',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-7.png',
        },
        {
          id: '03',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-8.png',
        },
      ],
      afterTreatment: [
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوملوري',
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم',
      ],
      familyReview:
        'شكرا سبيكترا وكل الرفيق الطبى لطريقة العلاج المرنة جدا وشوط طريق طويل والنتيجة جدا رائعة',
      video: '',
    },
  },
  {
    id: 'story-4',
    childName: 'حلا محمد العانزي',
    daignosis: 'اضطراب طيف التوحد',
    image: '/demo-baby-1.png',
    story: {
      description:
        'اضطراب طيف التوحد عبارة عن حالة ترتبط بنمو الدماغ وتؤثر على كيفية تمييز الشخص للآخرين والتعامل معهم على المستوى الاجتماعي، مما يتسبب في حدوث مشكلات في التفاعل والتواصل الاجتماعي.',
      beforeTreatment: [
        'يرفض العناق والإمساك به، ويبدو أنه يفضل اللعب بمفرده؛ أي ينسحب إلى عالمه الخاص',
        'عدم الكلام أو التأخر في الكلام، أو قد يفقد الطفل قدرته السابقة على التلفظ بالكلمات والجمل',
        'يتكلم بنبرة أو إيقاع غير طبيعي؛ وقد يستخدم صوتًا رتيبًا أو يتكلم مثل الإنسان الآلي',
      ],
      cureMethod: [
        {
          id: '01',
          text: 'العلاجات التربوية. غالبًا ما يستجيب الأطفال المصابون باضطراب طيف التوحد جيدًا للبرامج التربوية التي تتميز بدرجة عالية من التنظيم.',
          image: '/demo-baby-6.png',
        },
        {
          id: '02',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-7.png',
        },
        {
          id: '03',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-8.png',
        },
      ],
      afterTreatment: [
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوملوري',
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم',
      ],
      familyReview:
        'شكرا سبيكترا وكل الرفيق الطبى لطريقة العلاج المرنة جدا وشوط طريق طويل والنتيجة جدا رائعة',
      video: '',
    },
  },
  {
    id: 'story-5',
    childName: 'حلا محمد العانزي',
    daignosis: 'اضطراب طيف التوحد',
    image: '/demo-baby-2.png',
    story: {
      description:
        'اضطراب طيف التوحد عبارة عن حالة ترتبط بنمو الدماغ وتؤثر على كيفية تمييز الشخص للآخرين والتعامل معهم على المستوى الاجتماعي، مما يتسبب في حدوث مشكلات في التفاعل والتواصل الاجتماعي.',
      beforeTreatment: [
        'يرفض العناق والإمساك به، ويبدو أنه يفضل اللعب بمفرده؛ أي ينسحب إلى عالمه الخاص',
        'عدم الكلام أو التأخر في الكلام، أو قد يفقد الطفل قدرته السابقة على التلفظ بالكلمات والجمل',
        'يتكلم بنبرة أو إيقاع غير طبيعي؛ وقد يستخدم صوتًا رتيبًا أو يتكلم مثل الإنسان الآلي',
      ],
      cureMethod: [
        {
          id: '01',
          text: 'العلاجات التربوية. غالبًا ما يستجيب الأطفال المصابون باضطراب طيف التوحد جيدًا للبرامج التربوية التي تتميز بدرجة عالية من التنظيم.',
          image: '/demo-baby-6.png',
        },
        {
          id: '02',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-7.png',
        },
        {
          id: '03',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-8.png',
        },
      ],
      afterTreatment: [
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوملوري',
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم',
      ],
      familyReview:
        'شكرا سبيكترا وكل الرفيق الطبى لطريقة العلاج المرنة جدا وشوط طريق طويل والنتيجة جدا رائعة',
      video: '',
    },
  },
  {
    id: 'story-6',
    childName: 'حلا محمد العانزي',
    daignosis: 'اضطراب طيف التوحد',
    image: '/demo-baby-3.png',
    story: {
      description:
        'اضطراب طيف التوحد عبارة عن حالة ترتبط بنمو الدماغ وتؤثر على كيفية تمييز الشخص للآخرين والتعامل معهم على المستوى الاجتماعي، مما يتسبب في حدوث مشكلات في التفاعل والتواصل الاجتماعي.',
      beforeTreatment: [
        'يرفض العناق والإمساك به، ويبدو أنه يفضل اللعب بمفرده؛ أي ينسحب إلى عالمه الخاص',
        'عدم الكلام أو التأخر في الكلام، أو قد يفقد الطفل قدرته السابقة على التلفظ بالكلمات والجمل',
        'يتكلم بنبرة أو إيقاع غير طبيعي؛ وقد يستخدم صوتًا رتيبًا أو يتكلم مثل الإنسان الآلي',
      ],
      cureMethod: [
        {
          id: '01',
          text: 'العلاجات التربوية. غالبًا ما يستجيب الأطفال المصابون باضطراب طيف التوحد جيدًا للبرامج التربوية التي تتميز بدرجة عالية من التنظيم.',
          image: '/demo-baby-6.png',
        },
        {
          id: '02',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-7.png',
        },
        {
          id: '03',
          text: 'العلاج الأسري. يتعلم الآباء وأفراد الأسرة الآخرون كيفية اللعب والتفاعل مع أطفالهم المرضى بطرق تحفز المهارات الاجتماعية وتعالج المشكلات السلوكية',
          image: '/demo-baby-8.png',
        },
      ],
      afterTreatment: [
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوملوري',
        'لوريم إيبسو ملوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم إيبسوم لوريم إيبسوملوريم',
      ],
      familyReview:
        'شكرا سبيكترا وكل الرفيق الطبى لطريقة العلاج المرنة جدا وشوط طريق طويل والنتيجة جدا رائعة',
      video: '',
    },
  },
];
