export const TEAM = [
  {
    id: '1',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    avatar: '',
    rate: 9.5,
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '2',
    doctor: 'احمد محمد كمال',
    profession: 'توحد',
    rate: 9.1,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '3',
    doctor: 'احمد محمد كمال',
    profession: 'فرط حركة',
    rate: 8.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '4',
    doctor: 'احمد محمد كمال',
    profession: 'ثنائي القطب',
    rate: 9.8,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '5',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 8.6,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '6',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 9.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '7',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 8.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '8',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 9.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '9',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 8.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '10',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 9.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '11',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 8.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '12',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 9.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '13',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 8.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
  {
    id: '14',
    doctor: 'احمد محمد كمال',
    profession: 'اخصائى نفسي',
    rate: 9.5,
    avatar: '',
    exp: '3 سنوات',
    email: 'sH9zZ@example.com',
    career: {
      joinDate: '2024-10-28T14:20:25.381Z',
      summary:
        'دكتوراه في الفلسفة بالخدمة الاجتماعية مختص في تطوير الذات والعلاقات الاسرية والزوجية والمشاكل النفسية والإدمان والمشكلات ',
      qualifications:
        ' مرخص معتمد من الهيئة السعودية للتخصصات الصحية',
      licenseNo: '5215664',
      exp: '3 سنوات',
    },
    specializations: [
      'القلق',
      'الضغوط',
      'مشكلات في العلاقات',
      'فرط الحركة',
      'التعامل مع الغضب',
      'ثنائي القطب',
      'اضطرابات الشخصية',
      'القلق الاجتماعي ، الفوبيا',
      'مشكلات بالتواصل',
    ],
    certificates: [
      {
        id: 1,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 2,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
      {
        id: 3,
        name: 'دكتوراه العلوم الطبية',
        date: '2024-10-28T14:20:25.381Z',
        image: '/demo-certificate.png',
      },
    ],
    reviews: [
      {
        id: 1,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 2,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
      {
        id: 3,
        name: 'امانى محمود',
        rate: 9.5,
        comment:
          'لقد كانت تجربتى مع الدكتور احمد محمد جدا رائعة ومميزة بالتوفيق الك',
        date: '2024-10-28T14:20:25.381Z',
      },
    ],
  },
];
