using Mapster;
using MediatR;
using Spectra.Application.Contracts.DTO;
using Spectra.Application.Interfaces;
using Spectra.Domain.Contracts;
using Spectra.Domain.Shared.Common.Exceptions;
using Spectra.Domain.Shared.Wrappers;
using static Spectra.Domain.Shared.Constants.ContractConses;

namespace Spectra.Application.Contracts.Queries
{
    public class GetContractTextQuery : IRequest<OperationResult>
    {
        public string Id { get; set; }

        public class GetContractSectionQueryHandler(IBaseMongoDbRepository<EmploymentContract> contractRepository) : IRequestHandler<GetContractTextQuery, OperationResult>
        {
            private readonly IBaseMongoDbRepository<EmploymentContract> _contractRepository = contractRepository;

            public async Task<OperationResult> Handle(GetContractTextQuery request, CancellationToken cancellationToken)
            {
                var contract = await _contractRepository.GetAsync(c => c.Id == request.Id) ?? throw new NotFoundException("Contracts", request.Id);

                if (contract.Sections is null || contract.Sections.Count == 0)
                {
                    contract.InfoSection = new ContractEmployeeInfoSection
                    {
                        ArName = $"تم الاتفاق بين كل من (الطرف الثانى){contract.EmployeeName} و شركة مستقبل الرعاية الطبية(الطرف الاول)",
                        ArDate = $"انه فى تاريخ  {contract.AcceptingDate}",
                    };

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "موضوع العقد",
                        ARPoints = [$"تفق الطرفان على أن يقوم الطرف الثاني بتقديم خدمة الاستشارات الطبية لعملاء الطرف الأول بما يتناسب مع قدراته العملية والعلمية حسبما يملية علية الطرف الاول وحسبما تقضيه طبيعة العمل .",
                        " اتفق الطرفان على أن يقوم الطرف الثاني بأية مهام أو واجبات أخري يٌكلف بها مما يتلاءم مع مهنته أو مؤهلاته العلمية والعملية مما له ارتباط بمجال تخصصه، ويتعهد الطرف الثاني بتأدية ما يعهد إليه من واجبات ومسئوليات بدقة وأمانة وعلى أفضل وجه، وفقاً لتعليمات وتوجيهات الطرف الأول، ويلتزم بتحقيق الأهداف المناطة به ."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "البند الأول: الأخلاقيات المهنية:",
                        ARPoints = ["تقوى الله وتقديم الخدمة بأعلى معايير الجودة وبمرونة كاملة تناسب كل مستفيد بمهنية عالية وحب",
                        "يلتزم المتعاقد بالأمانة الشرعية أمام الله و بالأخلاقيات الإسلامية والمجتمعية دوماً وأن تكون إطاراً عاماً لجميع ما له علاقة بالعمل مع مركز سبيكترا الطبي ومنها على سبيل المثال لا الحصر: أن لا يقوم بالاستفادة بشكل شخصي من عملاء المركز لحسابه الخاص أو أن يقوم بالتواصل معهم شخصياً بغير أدوات المركز الرسمية وكذلك أن لا يقوم بتحويل العملاء تلميحاً أو تصريحاً إلى منصات أو جهات أو أي طرق أخرى مهما دعت الحاجة.",
                        "تقديم جدول شهري مسبق لأوقات توفر المتعاقد ليتم جدولة المواعيد بناء عليها.",
                        " الالتزام بحضور المواعيد في وقتها.",
                        "في حال حصول ظرف طارئ يمنع من حضور الجلسة المجدولة، يتم إخطار الإدارة بذلك برسالة رسمية قبل موعدها بـ 48 ساعة على الأقل.",
                        "يحق للمركز توفير بديل لتقديم الخدمة واستئناف جلسة التدريب أو التقييم من حيث انتهى المختص الأساسي ريثما يعود للعمل ويتم استقطاع سعر ما تم تقديمه بالإنابة لصالح المختص البديل."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "البند الثاني: الالتزام بالتعليمات واللوائح:",
                        ARPoints = ["يجب احترام الإجراءات والسياسات العامة التي وضعها المركز حيث تعتبر الكفاءة والالتزام بها من شروط التعاقد.",
                        "يجب على المختص الالتزام بالتعليمات والقرارات الصادرة من الإدارة أثناء تقديم الخدمات والالتزام بالجدول الزمني المحدد."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "البند الثالث: جودة الخدمة:",
                        ARPoints = ["يجب الاهتمام بالعميل بشكل كامل وإعطائه الأولوية أثناء الجلسة وأن يكون الاهتمام حسب طبيعة الخدمات المقدمة وأن يكون التركيز على الجانب العملي والنظري معاً عند تقديم الخدمات.",
                        "يجب الاهتمام باللغة العربية/الانجليزية ولهجة المنطقة عند الحاجة مع مراعاة البيئة الاجتماعية والثقافية للعملاء في التعامل معهم."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "البند الرابع: المهارات التواصلية:",
                        ARPoints = ["يجب الاهتمام بنظافة المظهر العام والملابس والنظافة الشخصية والحرص على ارتداء الملابس المناسبة للعمل.",
                        "يجب الاهتمام بالوقت وعدم تأخير المواعيد مع العملاء والحرص على الالتزام بالمواعيد.",
                        "يجب أن يكون لديه شخصية جذابة وقادرة على كسب ثقة العملاء والتعامل معهم بلطف واحترام.",
                        "يجب أن يكون لديه مهارات اتصال جيدة والتواصل مع العملاء بطريقة واضحة ومباشرة."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "البند الخامس: المهارات المهنية:",
                        ARPoints = ["يجب أن يكون لديه القدرة على التعامل مع الضغوط والعمل تحت ضغط.",
                        "يجب أن يكون لديه القدرة على التعلم والتطوير من نفسه بشكل مستمر.",
                        "يجب أن يكون لديه القدرة على العمل بشكل فردي وجماعي.",
                        "يجب أن يكون لديه القدرة على حل المشكلات واتخاذ القرارات.",
                        "يجب أن يكون لديه القدرة على التكيف مع التغيرات.",
                        "يجب أن يكون لديه القدرة على إدارة الوقت بشكل فعال.",
                        "يجب أن يكون لديه القدرة على تنظيم العمل.",
                        "يجب أن يكون لديه القدرة على تقديم تقارير دقيقة وواضحة.",
                        "يجب أن يكون لديه القدرة على الالتزام بالسرية."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "البند السادس: التعامل مع مختلف الفئات:",
                        ARPoints = ["يجب أن يكون لديه القدرة على التعامل مع العملاء من مختلف الثقافات والأجناس.",
                            "يجب أن يكون لديه القدرة على التعامل مع العملاء ذوي الاحتياجات الخاصة وذويهم."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "البند السابع: التعامل مع الحالات الخاصة:",
                        ARPoints = ["يجب أن يكون لديه القدرة على التعامل مع العملاء الذين يعانون من مشاكل نفسية.",
                        "يجب أن يكون لديه القدرة على التعامل مع العملاء الذين يعانون من مشاكل سلوكية.",
                        "يجب أن يكون لديه القدرة على التعامل مع العملاء الذين يعانون من مشاكل تعليمية.",
                        "يجب أن يكون لديه القدرة على التعامل مع العملاء الذين يعانون من مشاكل طبية.",
                        "يجب أن يكون لديه القدرة على التعامل مع العملاء الذين يعانون من مشاكل اجتماعية."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "حقوق والتزامات الطرف الأول :",
                        ARPoints = [" يدفع الطرف الأول للطرف الثاني مكافأة شهرية بداية كل شهر ميلادي (عشرة أيام كحد اقصى) عن الشهر السابق كنسبة مئوية قدرها (س) من اجمالي سعر الجلسات التقييمية و (س) من اجمالي سعر الخدمات التدريبية التي تم تقديمها من قبل الطرف الثاني وبعد استيفاء الرسوم الضريبية ان وجدت .",
                        "تبقى النسبة المشار إليها في الفقرة الأولى من البند الثالث من هذا العقد سارية حتى أثناء العروض الترويجية التي يقررها الطرف الأول ",
                        "تبقى النسبة المشار إليها في الفقرة الأولى من البند الثالث من هذا العقد سارية حتى أثناء تغيير لائحة الأسعار التي يقررها الطرف الأول",
                        "يلتزم الطرف الأول بتوفير منصة للتواصل بين عملائه والطرف الثاني، ويحق له في جميع الأوقات مراقبتها ومتابعتها وتسجيلها بهدف الجودة والتطوير",
                        "يحق للطرف الأول تغيير سياسات المركز الداخلية في أي وقت دون الرجوع للطرف الثاني واشعاره بذلك."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "حقوق والتزامات الطرف الثاني :",
                        ARPoints = ["أن ينجز العمل الموكل إليه بنفسه وفقاً لأصول المهنة، ووفق تعليمات الطرف الأول، إذا لم يكن في هذه التعليمات ما يخالف العقد، أو النظام، أو الآداب العامة ، ولم يكن في تنفيذها ما يعرضه للخطر .",
                        "يلتزم الطرف الثاني بحسن السلوك، والأخلاق والأنظمة والأعراف والعادات والآداب المرعية في المملكة العربية السعودية أثناء العمل، كما ويلتزم بتطبيق القواعد واللوائح والتعليمات الصادرة المشرعة لخدمات الطب الاتصالى فى المملكة العربية السعودية وتعديلاتها ، ويتحمل كافة الغرامات المالية الناتجة عن مخالفتة لذلك.",
                        "يلتزم الطرف الثاني بأداء المهام المنوطة به وفق الحد الأدنى للمعايير المهنية الطبية المعمول بها في المملكة العربية السعودية.",
                        "يلتزم الطرف الثاني بالظهور بشكل لائق عند أداءه للعمل وذلك حسب العرف السائد ووفقا لم تحدده الأنظمة والقوانين وسياسات المركز. ",
                        "يلتزم الطرف الثاني بعدم إفشاء أسرار الطرف الأول بعد انتهاء العقد. ",
                        "يلتزم الطرف الثاني بالتواصل مع عملاء الطرف الأول فقط عن طريق الوسائل المخصصة لة من قبل الطرف الأول لذلك كما يلتزم بعدم اعطاء أي عميل رقمة الخاص و التواصل بغير الطرق المخصصة لة .",
                        "يتحمل الطرف الثاني وحده مسؤلية الأخطاء الطبية و الفنية الناتجة عن تقصيره او اهماله .",
                        "يتحمل الطرف الثاني وحده مسؤولية وتكاليف متابعة الشكاوى أو الدعاوي المرفوعة ضده أو ضد المركز اذا كان سبباً بها مالم يصدر حكم قضائي نهائي يثبت براءتة .",
                        "يلتزم الطرف الثاني بأن يتحمل وحده كافة التكاليف والتبعات في حال تعرضه للمساءلة القانونية والجنائية من قبل الجهات الحكومية أو أي طرف ثالث لإخلاله بالالتزامات المطلوبة منه في هذا العقد .",
                        "يلتزم الطرف الثاني بالمحافظة على سمعة الطرف الأول ويتعهد بعدم الاساءة لها بأي شكل من الأشكال ومنها على سبيل المثال وسائل التواصل الاجتماعي، وفي حال اخلال الطرف الثاني بهذا البند يحق للطرف الأول اتخاذ كافة الإجراءات النظامية والوقائية حيال ذلك .",
                        "يتعهد الطرف الثاني بتزويد الطرف الأول بكافة الشهادات والوثائق التي تثبت صلاحيته لإنجاز العمل المطلوب حسب التشريعات المنظمة.",
                        "يلتزم الطرف الثاني وعلى حسابه الخاص بتوفير الوسائل والأدوات التي تمكنه من أداءه للخدمات الاستشارية المطلوبة منه . ",
                        "بمجرد التوقيع على هذا العقد يلتزم الطرف الثاني ضمنياً بالموافقة على أي تعديل لاحق لسياسات المركز الداخلية أو لائحة الأسعار أو الوصف الوظيفي  التي يجربها الطرف الأول بإرادتة المنفردة على ان يتم اشعارة بكافة التعديلات ."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "تعليمات وشروط فى حالات الاعطال الفنية :",
                        ARPoints = ["يلتزم الطرف الثانى بالتواجد او اثبات التواجد على المنصة قبل معاد اى جلسة بحد اقصى 1 دقيقة .",
                        "تستعمل المنصة انظمة مراقبة تتبع الطلبات التى تتم على خوادم المنصة وجميع الخدمات الملحقة مما يوضح مواعيد الانضمام والخروج وانقطاع الشبكة عن الجلسات . تتحقق المنصة دائما من كافة وجميع الحركات التى تتم اثناء , قبل وبعد الجلسة وتستعين باطراف ثالثة محايدة يتعين عليها توضيح اسباب خروج او انقطاع احد اطراف الجلسة (العميل او الطرف الثانى) من الجلسة مع ذكر الوقت والتاريخ",
                        "فى حال اثبات وجود عطل فنى “سببه المنصة” ادى الى انقطاع الخدمة او منع مقدم الخدمة (الطرف الثانى) من تادية عملة يتعين على المنصة تحمل التكاليف الاتية : ",
                        "اذا كانت الجلسة لم تبدء بعد وتعذر على الطرف الثانى الانضمام : 0% من استحقاق الطرف الثانى",
                        "اذا بدئت الجلسة وانضم الطرف الثانى اليها مدة اقصاها 5 دقائق ثم انقطع الاتصال وتعذر عليه الانضمام : 15% من تكاليف الطرف الثانى ",
                        "اذا بدئت الجلسة وانضم الطرف الثانى اليها مدة اقصاها من 6 دقائق الى نصف وقت الجلسة ثم انقطع الاتصال وتعذر عليه الانضمام : 50% من تكاليف الجلسة",
                        "اذا بدئت الجلسة وانضم الطرف الثانى اليها مدة اكثر من نصف وقت الجلسة ثم انقطع الاتصال وتعذر عليه الانضمام : 80% من تكاليف الجلسة",
                        "فى حال اثبات عطل فنى “سببه الطرف الثانى او احد الادوات او الاجهزة او البرامج التى يستعملها” ادى الى منعه من تقديم الخدمة يتعين على المنصة تحمل التكاليف الاتيه : ",
                        "اذا كانت الجلسة لم تبدء بعد وتعذر على الطرف الثانى الانضمام : 0% من استحقاق الطرف الثانى",
                        "اذا بدئت الجلسة وانضم الطرف الثانى اليها مدة اقل من او تساوى نصف وقت الجلسة ثم انقطع الاتصال وتعذر عليه الانضمام : 15% من تكاليف الجلسة",
                        "اذا بدئت الجلسة وانضم الطرف الثانى اليها مدة اكثر من نصف وقت الجلسة ثم انقطع الاتصال وتعذر عليه الانضمام : 50% من تكاليف الجلسة",
                        "فى حال اثبات عطل فنى “سببه العميل او احد الادوات او الاجهزة او البرامج التى يستعملها” ادى الى منعه من تلقى الخدمة يتعين على المنصة تحمل التكاليف الاتيه :",
                        "اذا كانت الجلسة لم تبدء بعد وتعذر على العميل من الانضمام : 0% من استحقاق الطرف الثانى",
                        "اذا بدئت الجلسة وانضم العميل اليها مدة اقصاها 5 دقائق ثم انقطع الاتصال وتعذر عليه الانضمام : 15% من تكاليف الطرف الثانى",
                        "اذا بدئت الجلسة وانضم العميل اليها مدة اقصاها من 6 دقائق الى نصف وقت الجلسة ثم انقطع الاتصال وتعذر عليه الانضمام : 50% من تكاليف الجلسة",
                        "اذا بدئت الجلسة وانضم العميل اليها مدة اكثر من نصف وقت الجلسة ثم انقطع الاتصال وتعذر عليه الانضمام : 80% من تكاليف الجلسة"]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "تعليمات وشروط حالات التخلف او الاعتذار عن المواعيد :",
                        ARPoints = ["يلتزم الطرف الثانى باخطار المنصة فى حال رغبته فى الاعتذار عن موعد او التوقف عن العمل لفترة او طلب اجازة بان يخبر الاشخاص المعنية فى الطاقم الادارى للمنصة عن طريق وسائل التواصل المتاحة .",
                        "قد ترفض المنصة الاعتراف بالاجازة او العذر نسبة للمواعيد المسبق تحديدها مع العملاء اذا تداخلة اوقتها مع اوقات ايام العطلة او الاجازة ويعتبر طلب العطلة لايام يقع فيها مواعيد مسبقة الحجز مرفوض وغير معترف به ابتدائا الا ان تقرر المنصة العكس.",
                        "فى حال حدوث امر قهرى يمنع الطرف الثانى من تادية موعد وقام باخطار المنصة فى مدة لا تقل عن 48 س يسمح له باعادة جدولة الموعد دون التعرض لاى انذارات او اخطارات بالغياب",
                        "فى حال حدوث امر قهرى يمنع الطرف الثانى من تادية موعد وقام باخطار المنصة فى مدة اقل من 48 ساعة وحدث هذا للمرة الاولى يسمح له باعادة جدولة الموعد دون التعرض لاى انذارات او اخطارات بالغياب وعلى كل عذر اخر تم تقديمه فى مدة اقل من 48 س انذار من المنصة بالتاخير فى تقديم العذر",
                        "اذا وصل عدد انذارات الطرف الثانى الى 3 قد تقرر المنصة توقف العمل على حسابة واحالته الى مدير القسم المختص لاعادة التقيم والتوصية بتشغيل الحساب او عدمه.",
                        "اذا تخلف الطرف الثانى عن حضور جلسة دون تقديم عذر مسبق او اثبات ان سبب التخلف كان قهريا . يتم احتساب انذار بالغياب ",
                        "اذا وصل عدد انذارات الغياب لدى الطرف الثانى الى 2 قد يتيعن على المنصة اقاف حسابة وتحويلة الى مدير القسم المختصم للنظر فى سجلة و التوصية باعادة تشغيل حسابة او عدمه."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "الإجازات :",
                        ARPoints = [" لا يستحق الطرف الثاني أية اجازات مدفوعة الأجر لقاء قيامه بالأعمال الاستشارية.",]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "مدة العقد و ساعات العمل :",
                        ARPoints = [" مدة هذا العقد (سنة واحدة) تبدأ من تاريخ المباشرة الفعلية، وتتجدد لمدد مماثلة مالم يخطر أحد الطرفين الأخر بعدم رغبته في الاستمرارية قبل شهرين على الأقل من تاريخ انتهاء العقد.",
                        "اتفق الطرفان على أن يؤدي الطرف الثاني ساعات عمل معينة تحدد لاحقاً بحسب احتياج المركز بما لا يتعارض مع جدول مواعيد الطرف الثاني لدى الجهات الأخري."]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "انتهاء العقد أو إنهاءه :",
                        ARPoints = ["تعتبر الفترة التجريبية ثلاثة أشهر، يحق فيها للطرفين إنهاء العقد بمحض ارادتهما او أحدهما دون الزام بذكر السبب .",
                        "في حال انتهاء مدة العقد الأصلية أو المجددة ",
                        "يحق للطرف الأول بإرادته المنفردة ولأسباب تعود له فسخ العقد في أي وقت بمجرد اخطار الطرف الثاني بذلك مع احتفاظ الطرف الثاني بحقوقه إن وجدت . ",
                        "يحق للطرف الأول بإرادته المنفردة فسخ العقد في أي وقت بمجرد اخطار الطرف الثاني في حال تقصير الطرف الثاني بأي من التزاماته الواردة في هذا العقد ، ولا يحق للطرف الثاني في هذه الحالة المطالبة بأي تعويض.",
                        "يحق للطرف الثاني بإرادته المنفردة فسخ العقد لأسباب معقولة بمجرد اخطار الطرف الأول قبل شهر علي الأقل من تاريخ الفسخ ، ولا يحق للطرف الثاني في هذه الحاله المطالبة بأي تعويض.(محتاج يخلص كل المواعيد المدفوعة والمسجلة فى جدولة قبل فسخ العقد الا فى حالة عدم استاطاعته لاسباب قهرية)"]
                    });

                    contract.Sections.Add(new ContractTextSection
                    {
                        ArTitle = "أحكام عامة : ",
                        ARPoints = ["اتفق الطرفان على أن يصنف هذا العقد كعقد استشارات وليس عقد عمل، لذا فإنه لا يترتب على الطرف الأول أية التزامات مادية أو معنوية تجاه الطرف الثاني سواء من جانب التأمينات الاجتماعية أو التأمين الطبي أو مكافأة نهاية الخدمة أو غير ذلك، وإنما يلتزم فقط بالأمور المتفق عليها بموجب هذا العقد .",
                        " يحل هذا العقد محل كافة الاتفاقيات والعقود السابقة الشفهية منها أو الكتابية إن وجدت. ",
                        "في حالة نشوء خلاف بين الطرفين حول هذا العقد، فإن الاختصاص القضائي ينعقد للجهة المختصة في المملكة العربية السعودية. ",
                        "تتم الإخطارات، والإشعارات بين الطرفين كتابة على العنوان الموضح بصدر هذا العقد عن طريق البريد المسجل أو البريد الإلكتروني لكل من الطرفين، ويلتزم كل طرف بإشعار الآخر خطياً في حال تغييره للعنوان الوطني الخاص به، أو تغيير البريد الالكتروني، وإلا اعتبر العنوان، أو البريد الالكتروني المدونان أعلاه ، هما المعمول بهما نظاماً .",
                        "حرر هذا العقد من نسختين أصليتين باللغة العربية ، وقد تسلم كل طرف نسخة منة للعمل بموجبها "]
                    });

                    var currentVersion = contract.Versions.First(v => v.State == ContractVersionStates.Active);

                    foreach (var service in currentVersion.SpectraTeamServices)
                    {
                        contract.Sections.Add(new ContractTextSection
                        {
                            ArTitle = service.ArName,
                            ArDescription = service.ArTerms
                        });
                    }

                    foreach (var service in currentVersion.FreelancingServices)
                    {
                        contract.Sections.Add(new ContractTextSection
                        {
                            ArTitle = service.ArName,
                            ArDescription = service.ArTerms
                        });
                    }
                }

                var textSection = contract.Adapt<ContractTextReadDto>();

                return OperationResult<ContractTextReadDto>.Success(textSection);
            }
        }
    }
}
